const stepList = [
  {
    name: "formOne",
    label: "คุณต้องการติวในวิชาอะไร",
    items: [
      { label: "วัยอนุบาล", value: "วัยอนุบาล" },
      { label: "วัยประถมศึกษา", value: "วัยประถมศึกษา" },
      { label: "วัยมัธยมศึกษาตอนต้น", value: "วัยมัธยมศึกษาตอนต้น" },
      { label: "วัยมัธยมศึกษาตอนปลาย", value: "วัยมัธยมศึกษาตอนปลาย" },
      { label: "วัยมหาวิทยาลัย", value: "วัยมหาวิทยาลัย" },
      { label: "วัยผู้ใหญ่", value: "วัยผู้ใหญ่" },
    ],
  },
  {
    name: "formTwo",
    label: "เป้าหมายของการเรียนคืออะไร",
    items: [
      { label: "เพิ่มเกรด", value: "เพิ่มเกรด" },
      { label: "เตรียมสอบ", value: "เตรียมสอบ" },
      { label: "เพื่อการทำงาน", value: "เพื่อการทำงาน" },
      { label: "เรียน/ทำงานต่างประเทศ", value: "เรียน/ทำงานต่างประเทศ" },
      { label: "พูดกับชาวต่างชาติได้", value: "พูดกับชาวต่างชาติได้" },
    ],
  },
  {
    name: "formThree",
    label: "ต้องการเรียนกับครูสัญชาติใด?",
    items: [
      { label: "ครูคนไทย", value: "ครูคนไทย" },
      { label: "ครูชาวต่างชาติ", value: "ครูชาวต่างชาติ" },
      { label: "อะไรก็ได้", value: "อะไรก็ได้" },
    ],
  },
  {
    name: "formFour",
    label: "เพศของผผู้สอน",
    items: [
      { label: "เพศชาย", value: "เพศชาย" },
      { label: "เพศหญิง", value: "เพศหญิง" },
      { label: "ไม่สำคัญ แค่สอนดีก็พอ", value: "ไม่สำคัญ แค่สอนดีก็พอ" },
    ],
  },
  {
    name: "formFive",
    label: "วันที่สะดวก",
    items: [
      { label: "วันจันทร์ - วันศุกร์", value: "วันจันทร์ - วันศุกร์" },
      { label: "วันเสาร์ - วันอาทิตย์", value: "วันเสาร์ - วันอาทิตย์" },
      { label: "ทุกวัน", value: "ทุกวัน" },
    ],
  },
  {
    name: "formSix",
    label: "ช่วงเวลาของวันที่สะดวก",
    items: [
      { label: "ก่อน 12:00", value: "ก่อน 12:00" },
      { label: "12:00 - 15:00", value: "12:00 - 15:00" },
      { label: "15:00 - 18:00", value: "15:00 - 18:00" },
      { label: "หลัง 18:00", value: "หลัง 18:00" },
      { label: "เวลาไหนก็ได้", value: "เวลาไหนก็ได้" },
    ],
  },
  {
    name: "formSeven",
    label: "ผู้เรียนต้องการเริ่มเรียนเมื่อใด?",
    items: [
      {
        label: "ทันทีที่พบคุณครูที่ผู้เรียนต้องการ",
        value: "ทันทีที่พบคุณครูที่ผู้เรียนต้องการ",
      },
      {
        label: "ยังไม่แน่ใจ แต่ต้องการเริ่มเรียนเร็วๆนี้",
        value: "ยังไม่แน่ใจ แต่ต้องการเริ่มเรียนเร็วๆนี้",
      },
      {
        label: "ไม่ใช่ตอนนี้ ไม่รู้เมื่อใด",
        value: "ไม่ใช่ตอนนี้ ไม่รู้เมื่อใด",
      },
    ],
  },
  {
    name: "formEight",
    label: "คุณต้องการเรียนอย่างไร",
    items: [
      { label: "ตัวต่อตัว", value: "ตัวต่อตัว" },
      { label: "ออนไลน์ (video call)", value: "ออนไลน์ (video call)" },
    ],
  },
  {
    name: "formNine",
    label: "คุณต้องการเรียนที่ไหนมากกว่ากัน?",
    items: [
      { label: "ที่บ้านของผู้เรียน", value: "ที่บ้านของผู้เรียน" },
      { label: "ที่สถานที่ของผู้สอน", value: "ที่สถานที่ของผู้สอน" },
      { label: "สถานที่สาธารณะ", value: "สถานที่สาธารณะ" },
      { label: "ที่ไหนก็ได้", value: "ที่ไหนก็ได้" },
    ],
  },
];

export default stepList;
